Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/firmware/src/packs/PIC32CX2051MTSH128_DFP/component/cpkcc.h
/* -------- CPKCC_IDLE : (CPKCC Offset: 0x2C) (R/W 8) IDLE Register -------- */
#define CPKCC_IDLE_VALUE_Pos                  _UINT8_(0)                                           /* (CPKCC_IDLE) CPKCC_IDLE value Position */
#define CPKCC_IDLE_VALUE_Msk                  (_UINT8_(0xFF) << CPKCC_IDLE_VALUE_Pos)              /* (CPKCC_IDLE) CPKCC_IDLE value Mask */
#define CPKCC_IDLE_VALUE(value)               (CPKCC_IDLE_VALUE_Msk & (_UINT8_(value) << CPKCC_IDLE_VALUE_Pos)) /* Assigment of value for VALUE in the CPKCC_IDLE register */
#define CPKCC_IDLE_Msk                        _UINT8_(0xFF)                                        /* (CPKCC_IDLE) Register Mask  */


/* -------- CPKCC_IDLECACHE : (CPKCC Offset: 0x2D) (R/W 8) IDLECACHE Register -------- */
#define CPKCC_IDLECACHE_VALUE_Pos             _UINT8_(0)                                           /* (CPKCC_IDLECACHE) CPKCC_IDLECACHE value Position */
#define CPKCC_IDLECACHE_VALUE_Msk             (_UINT8_(0xFF) << CPKCC_IDLECACHE_VALUE_Pos)         /* (CPKCC_IDLECACHE) CPKCC_IDLECACHE value Mask */
#define CPKCC_IDLECACHE_VALUE(value)          (CPKCC_IDLECACHE_VALUE_Msk & (_UINT8_(value) << CPKCC_IDLECACHE_VALUE_Pos)) /* Assigment of value for VALUE in the CPKCC_IDLECACHE register */
#define CPKCC_IDLECACHE_Msk                   _UINT8_(0xFF)                                        /* (CPKCC_IDLECACHE) Register Mask  */


/* -------- CPKCC_CR_C : (CPKCC Offset: 0x30) (R/W 32) CR_C Register -------- */
#define CPKCC_CR_C_VALUE_Pos                  _UINT32_(0)                                          /* (CPKCC_CR_C) CPKCC_CR_C value Position */
#define CPKCC_CR_C_VALUE_Msk                  (_UINT32_(0xFFFFFFFF) << CPKCC_CR_C_VALUE_Pos)       /* (CPKCC_CR_C) CPKCC_CR_C value Mask */
#define CPKCC_CR_C_VALUE(value)               (CPKCC_CR_C_VALUE_Msk & (_UINT32_(value) << CPKCC_CR_C_VALUE_Pos)) /* Assigment of value for VALUE in the CPKCC_CR_C register */
#define CPKCC_CR_C_Msk                        _UINT32_(0xFFFFFFFF)                                 /* (CPKCC_CR_C) Register Mask  */


/* -------- CPKCC_CR_S : (CPKCC Offset: 0x34) (R/W 32) CR_S Register -------- */
#define CPKCC_CR_S_VALUE_Pos                  _UINT32_(0)                                          /* (CPKCC_CR_S) CPKCC_CR_S value Position */
#define CPKCC_CR_S_VALUE_Msk                  (_UINT32_(0xFFFFFFFF) << CPKCC_CR_S_VALUE_Pos)       /* (CPKCC_CR_S) CPKCC_CR_S value Mask */
#define CPKCC_CR_S_VALUE(value)               (CPKCC_CR_S_VALUE_Msk & (_UINT32_(value) << CPKCC_CR_S_VALUE_Pos)) /* Assigment of value for VALUE in the CPKCC_CR_S register */
#define CPKCC_CR_S_Msk                        _UINT32_(0xFFFFFFFF)                                 /* (CPKCC_CR_S) Register Mask  */


/* -------- CPKCC_CR : (CPKCC Offset: 0x38) (R/W 32) CR Register -------- */
#define CPKCC_CR_GF2N_Pos                     _UINT32_(0)                                          /* (CPKCC_CR) GF(2n) mode Position */
#define CPKCC_CR_GF2N_Msk                     (_UINT32_(0x1) << CPKCC_CR_GF2N_Pos)                 /* (CPKCC_CR) GF(2n) mode Mask */
#define CPKCC_CR_GF2N(value)                  (CPKCC_CR_GF2N_Msk & (_UINT32_(value) << CPKCC_CR_GF2N_Pos)) /* Assigment of value for GF2N in the CPKCC_CR register */
#define CPKCC_CR_CARRYIN_Pos                  _UINT32_(1)                                          /* (CPKCC_CR) CARRYIN value Position */
#define CPKCC_CR_CARRYIN_Msk                  (_UINT32_(0x1) << CPKCC_CR_CARRYIN_Pos)              /* (CPKCC_CR) CARRYIN value Mask */
#define CPKCC_CR_CARRYIN(value)               (CPKCC_CR_CARRYIN_Msk & (_UINT32_(value) << CPKCC_CR_CARRYIN_Pos)) /* Assigment of value for CARRYIN in the CPKCC_CR register */
#define CPKCC_CR_ONEMUL_Pos                   _UINT32_(2)                                          /* (CPKCC_CR) ONEMUL value Position */
#define CPKCC_CR_ONEMUL_Msk                   (_UINT32_(0x1) << CPKCC_CR_ONEMUL_Pos)               /* (CPKCC_CR) ONEMUL value Mask */
#define CPKCC_CR_ONEMUL(value)                (CPKCC_CR_ONEMUL_Msk & (_UINT32_(value) << CPKCC_CR_ONEMUL_Pos)) /* Assigment of value for ONEMUL in the CPKCC_CR register */
#define CPKCC_CR_ABORT_Pos                    _UINT32_(3)                                          /* (CPKCC_CR) ABORT value Position */
#define CPKCC_CR_ABORT_Msk                    (_UINT32_(0x1) << CPKCC_CR_ABORT_Pos)                /* (CPKCC_CR) ABORT value Mask */
#define CPKCC_CR_ABORT(value)                 (CPKCC_CR_ABORT_Msk & (_UINT32_(value) << CPKCC_CR_ABORT_Pos)) /* Assigment of value for ABORT in the CPKCC_CR register */
#define CPKCC_CR_SPILLW_Pos                   _UINT32_(4)                                          /* (CPKCC_CR) Spill Word register bit Position */
#define CPKCC_CR_SPILLW_Msk                   (_UINT32_(0x1) << CPKCC_CR_SPILLW_Pos)               /* (CPKCC_CR) Spill Word register bit Mask */
#define CPKCC_CR_SPILLW(value)                (CPKCC_CR_SPILLW_Msk & (_UINT32_(value) << CPKCC_CR_SPILLW_Pos)) /* Assigment of value for SPILLW in the CPKCC_CR register */
#define CPKCC_CR_AWAKE_Pos                    _UINT32_(5)                                          /* (CPKCC_CR) AWAKE value Position */
#define CPKCC_CR_AWAKE_Msk                    (_UINT32_(0x1) << CPKCC_CR_AWAKE_Pos)                /* (CPKCC_CR) AWAKE value Mask */
#define CPKCC_CR_AWAKE(value)                 (CPKCC_CR_AWAKE_Msk & (_UINT32_(value) << CPKCC_CR_AWAKE_Pos)) /* Assigment of value for AWAKE in the CPKCC_CR register */
#define CPKCC_CR_PKCCIRQ_Pos                  _UINT32_(6)                                          /* (CPKCC_CR) CPKCC_IRQ value Position */
#define CPKCC_CR_PKCCIRQ_Msk                  (_UINT32_(0x1) << CPKCC_CR_PKCCIRQ_Pos)              /* (CPKCC_CR) CPKCC_IRQ value Mask */
#define CPKCC_CR_PKCCIRQ(value)               (CPKCC_CR_PKCCIRQ_Msk & (_UINT32_(value) << CPKCC_CR_PKCCIRQ_Pos)) /* Assigment of value for PKCCIRQ in the CPKCC_CR register */
#define CPKCC_CR_ITEN_Pos                     _UINT32_(7)                                          /* (CPKCC_CR) ITEN value Position */
#define CPKCC_CR_ITEN_Msk                     (_UINT32_(0x1) << CPKCC_CR_ITEN_Pos)                 /* (CPKCC_CR) ITEN value Mask */
#define CPKCC_CR_ITEN(value)                  (CPKCC_CR_ITEN_Msk & (_UINT32_(value) << CPKCC_CR_ITEN_Pos)) /* Assigment of value for ITEN in the CPKCC_CR register */
#define CPKCC_CR_CLRRAM_Pos                   _UINT32_(8)                                          /* (CPKCC_CR) CLRRAM value Position */
#define CPKCC_CR_CLRRAM_Msk                   (_UINT32_(0x1) << CPKCC_CR_CLRRAM_Pos)               /* (CPKCC_CR) CLRRAM value Mask */
#define CPKCC_CR_CLRRAM(value)                (CPKCC_CR_CLRRAM_Msk & (_UINT32_(value) << CPKCC_CR_CLRRAM_Pos)) /* Assigment of value for CLRRAM in the CPKCC_CR register */
#define CPKCC_CR_VALUE_Pos                    _UINT32_(9)                                          /* (CPKCC_CR) CPKCC_CR value Position */
#define CPKCC_CR_VALUE_Msk                    (_UINT32_(0x7FFFFF) << CPKCC_CR_VALUE_Pos)           /* (CPKCC_CR) CPKCC_CR value Mask */
#define CPKCC_CR_VALUE(value)                 (CPKCC_CR_VALUE_Msk & (_UINT32_(value) << CPKCC_CR_VALUE_Pos)) /* Assigment of value for VALUE in the CPKCC_CR register */
#define CPKCC_CR_Msk                          _UINT32_(0xFFFFFFFF)                                 /* (CPKCC_CR) Register Mask  */


/* -------- CPKCC_OR : (CPKCC Offset: 0x3C) (R/W 32) Operation Register -------- */
#define CPKCC_OR_CMD0_Pos                     _UINT32_(0)                                          /* (CPKCC_OR) CMD0 value Position */
#define CPKCC_OR_CMD0_Msk                     (_UINT32_(0x1) << CPKCC_OR_CMD0_Pos)                 /* (CPKCC_OR) CMD0 value Mask */
#define CPKCC_OR_CMD0(value)                  (CPKCC_OR_CMD0_Msk & (_UINT32_(value) << CPKCC_OR_CMD0_Pos)) /* Assigment of value for CMD0 in the CPKCC_OR register */
#define CPKCC_OR_CMD1_Pos                     _UINT32_(1)                                          /* (CPKCC_OR) CMD1 value Position */
#define CPKCC_OR_CMD1_Msk                     (_UINT32_(0x1) << CPKCC_OR_CMD1_Pos)                 /* (CPKCC_OR) CMD1 value Mask */
#define CPKCC_OR_CMD1(value)                  (CPKCC_OR_CMD1_Msk & (_UINT32_(value) << CPKCC_OR_CMD1_Pos)) /* Assigment of value for CMD1 in the CPKCC_OR register */
#define CPKCC_OR_CMD2_Pos                     _UINT32_(2)                                          /* (CPKCC_OR) CMD2 value Position */
#define CPKCC_OR_CMD2_Msk                     (_UINT32_(0x1) << CPKCC_OR_CMD2_Pos)                 /* (CPKCC_OR) CMD2 value Mask */
#define CPKCC_OR_CMD2(value)                  (CPKCC_OR_CMD2_Msk & (_UINT32_(value) << CPKCC_OR_CMD2_Pos)) /* Assigment of value for CMD2 in the CPKCC_OR register */
#define CPKCC_OR_CMD3_Pos                     _UINT32_(3)                                          /* (CPKCC_OR) CMD3 value Position */
#define CPKCC_OR_CMD3_Msk                     (_UINT32_(0x1) << CPKCC_OR_CMD3_Pos)                 /* (CPKCC_OR) CMD3 value Mask */
#define CPKCC_OR_CMD3(value)                  (CPKCC_OR_CMD3_Msk & (_UINT32_(value) << CPKCC_OR_CMD3_Pos)) /* Assigment of value for CMD3 in the CPKCC_OR register */
#define CPKCC_OR_OPTM0_Pos                    _UINT32_(4)                                          /* (CPKCC_OR) OPTM0 value Position */
#define CPKCC_OR_OPTM0_Msk                    (_UINT32_(0x1) << CPKCC_OR_OPTM0_Pos)                /* (CPKCC_OR) OPTM0 value Mask */
#define CPKCC_OR_OPTM0(value)                 (CPKCC_OR_OPTM0_Msk & (_UINT32_(value) << CPKCC_OR_OPTM0_Pos)) /* Assigment of value for OPTM0 in the CPKCC_OR register */
#define CPKCC_OR_OPTM1_Pos                    _UINT32_(5)                                          /* (CPKCC_OR) OPTM1 value Position */
#define CPKCC_OR_OPTM1_Msk                    (_UINT32_(0x1) << CPKCC_OR_OPTM1_Pos)                /* (CPKCC_OR) OPTM1 value Mask */
#define CPKCC_OR_OPTM1(value)                 (CPKCC_OR_OPTM1_Msk & (_UINT32_(value) << CPKCC_OR_OPTM1_Pos)) /* Assigment of value for OPTM1 in the CPKCC_OR register */
#define CPKCC_OR_OPTC0_Pos                    _UINT32_(6)                                          /* (CPKCC_OR) OPTC0 value Position */
#define CPKCC_OR_OPTC0_Msk                    (_UINT32_(0x1) << CPKCC_OR_OPTC0_Pos)                /* (CPKCC_OR) OPTC0 value Mask */
#define CPKCC_OR_OPTC0(value)                 (CPKCC_OR_OPTC0_Msk & (_UINT32_(value) << CPKCC_OR_OPTC0_Pos)) /* Assigment of value for OPTC0 in the CPKCC_OR register */
#define CPKCC_OR_OPTC1_Pos                    _UINT32_(7)                                          /* (CPKCC_OR) OPTC1 value Position */
#define CPKCC_OR_OPTC1_Msk                    (_UINT32_(0x1) << CPKCC_OR_OPTC1_Pos)                /* (CPKCC_OR) OPTC1 value Mask */
#define CPKCC_OR_OPTC1(value)                 (CPKCC_OR_OPTC1_Msk & (_UINT32_(value) << CPKCC_OR_OPTC1_Pos)) /* Assigment of value for OPTC1 in the CPKCC_OR register */
#define CPKCC_OR_CARRYMUL_Pos                 _UINT32_(10)                                         /* (CPKCC_OR) CARRYMUL value Position */
#define CPKCC_OR_CARRYMUL_Msk                 (_UINT32_(0x1) << CPKCC_OR_CARRYMUL_Pos)             /* (CPKCC_OR) CARRYMUL value Mask */
#define CPKCC_OR_CARRYMUL(value)              (CPKCC_OR_CARRYMUL_Msk & (_UINT32_(value) << CPKCC_OR_CARRYMUL_Pos)) /* Assigment of value for CARRYMUL in the CPKCC_OR register */
#define CPKCC_OR_VALUE_Pos                    _UINT32_(11)                                         /* (CPKCC_OR) CPKCC_OR value Position */
#define CPKCC_OR_VALUE_Msk                    (_UINT32_(0x1FFFFF) << CPKCC_OR_VALUE_Pos)           /* (CPKCC_OR) CPKCC_OR value Mask */
#define CPKCC_OR_VALUE(value)                 (CPKCC_OR_VALUE_Msk & (_UINT32_(value) << CPKCC_OR_VALUE_Pos)) /* Assigment of value for VALUE in the CPKCC_OR register */
#define CPKCC_OR_Msk                          _UINT32_(0xFFFFFCFF)                                 /* (CPKCC_OR) Register Mask  */

#define CPKCC_OR_CMD_Pos                      _UINT32_(0)                                          /* (CPKCC_OR Position) CMDx value */
#define CPKCC_OR_CMD_Msk                      (_UINT32_(0xF) << CPKCC_OR_CMD_Pos)                  /* (CPKCC_OR Mask) CMD */
#define CPKCC_OR_CMD(value)                   (CPKCC_OR_CMD_Msk & (_UINT32_(value) << CPKCC_OR_CMD_Pos)) 
#define CPKCC_OR_OPTM_Pos                     _UINT32_(4)                                          /* (CPKCC_OR Position) OPTMx value */
#define CPKCC_OR_OPTM_Msk                     (_UINT32_(0x3) << CPKCC_OR_OPTM_Pos)                 /* (CPKCC_OR Mask) OPTM */
#define CPKCC_OR_OPTM(value)                  (CPKCC_OR_OPTM_Msk & (_UINT32_(value) << CPKCC_OR_OPTM_Pos)) 
#define CPKCC_OR_OPTC_Pos                     _UINT32_(6)                                          /* (CPKCC_OR Position) OPTCx value */
#define CPKCC_OR_OPTC_Msk                     (_UINT32_(0x3) << CPKCC_OR_OPTC_Pos)                 /* (CPKCC_OR Mask) OPTC */
#define CPKCC_OR_OPTC(value)                  (CPKCC_OR_OPTC_Msk & (_UINT32_(value) << CPKCC_OR_OPTC_Pos)) 

/* -------- CPKCC_SR : (CPKCC Offset: 0x40) (R/W 32) SR Register -------- */
#define CPKCC_SR_BUSY_Pos                     _UINT32_(0)                                          /* (CPKCC_SR) BUSY value Position */
#define CPKCC_SR_BUSY_Msk                     (_UINT32_(0x1) << CPKCC_SR_BUSY_Pos)                 /* (CPKCC_SR) BUSY value Mask */
#define CPKCC_SR_BUSY(value)                  (CPKCC_SR_BUSY_Msk & (_UINT32_(value) << CPKCC_SR_BUSY_Pos)) /* Assigment of value for BUSY in the CPKCC_SR register */
#define CPKCC_SR_CACHE_Pos                    _UINT32_(1)                                          /* (CPKCC_SR) CACHE value Position */
#define CPKCC_SR_CACHE_Msk                    (_UINT32_(0x1) << CPKCC_SR_CACHE_Pos)                /* (CPKCC_SR) CACHE value Mask */
#define CPKCC_SR_CACHE(value)                 (CPKCC_SR_CACHE_Msk & (_UINT32_(value) << CPKCC_SR_CACHE_Pos)) /* Assigment of value for CACHE in the CPKCC_SR register */
#define CPKCC_SR_CARRY_Pos                    _UINT32_(2)                                          /* (CPKCC_SR) CARRY value Position */
#define CPKCC_SR_CARRY_Msk                    (_UINT32_(0x1) << CPKCC_SR_CARRY_Pos)                /* (CPKCC_SR) CARRY value Mask */
#define CPKCC_SR_CARRY(value)                 (CPKCC_SR_CARRY_Msk & (_UINT32_(value) << CPKCC_SR_CARRY_Pos)) /* Assigment of value for CARRY in the CPKCC_SR register */
#define CPKCC_SR_ZERO_Pos                     _UINT32_(3)                                          /* (CPKCC_SR) ZERO value Position */
#define CPKCC_SR_ZERO_Msk                     (_UINT32_(0x1) << CPKCC_SR_ZERO_Pos)                 /* (CPKCC_SR) ZERO value Mask */
#define CPKCC_SR_ZERO(value)                  (CPKCC_SR_ZERO_Msk & (_UINT32_(value) << CPKCC_SR_ZERO_Pos)) /* Assigment of value for ZERO in the CPKCC_SR register */
#define CPKCC_SR_RAMV_Pos                     _UINT32_(4)                                          /* (CPKCC_SR) RAM violation Position */
#define CPKCC_SR_RAMV_Msk                     (_UINT32_(0x1) << CPKCC_SR_RAMV_Pos)                 /* (CPKCC_SR) RAM violation Mask */
#define CPKCC_SR_RAMV(value)                  (CPKCC_SR_RAMV_Msk & (_UINT32_(value) << CPKCC_SR_RAMV_Pos)) /* Assigment of value for RAMV in the CPKCC_SR register */
#define CPKCC_SR_SHAREV_Pos                   _UINT32_(5)                                          /* (CPKCC_SR) SHAREV value Position */
#define CPKCC_SR_SHAREV_Msk                   (_UINT32_(0x1) << CPKCC_SR_SHAREV_Pos)               /* (CPKCC_SR) SHAREV value Mask */
#define CPKCC_SR_SHAREV(value)                (CPKCC_SR_SHAREV_Msk & (_UINT32_(value) << CPKCC_SR_SHAREV_Pos)) /* Assigment of value for SHAREV in the CPKCC_SR register */
#define CPKCC_SR_CLRRAM_BUSY_Pos              _UINT32_(6)                                          /* (CPKCC_SR) CLRRAM_BUSY value Position */
#define CPKCC_SR_CLRRAM_BUSY_Msk              (_UINT32_(0x1) << CPKCC_SR_CLRRAM_BUSY_Pos)          /* (CPKCC_SR) CLRRAM_BUSY value Mask */
#define CPKCC_SR_CLRRAM_BUSY(value)           (CPKCC_SR_CLRRAM_BUSY_Msk & (_UINT32_(value) << CPKCC_SR_CLRRAM_BUSY_Pos)) /* Assigment of value for CLRRAM_BUSY in the CPKCC_SR register */
#define CPKCC_SR_VALUE_Pos                    _UINT32_(7)                                          /* (CPKCC_SR) CPKCC_SR value Position */
#define CPKCC_SR_VALUE_Msk                    (_UINT32_(0x1FFFFFF) << CPKCC_SR_VALUE_Pos)          /* (CPKCC_SR) CPKCC_SR value Mask */
#define CPKCC_SR_VALUE(value)                 (CPKCC_SR_VALUE_Msk & (_UINT32_(value) << CPKCC_SR_VALUE_Pos)) /* Assigment of value for VALUE in the CPKCC_SR register */
#define CPKCC_SR_Msk                          _UINT32_(0xFFFFFFFF)                                 /* (CPKCC_SR) Register Mask  */


