Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/firmware/src/packs/PIC32CX2051MTSH128_DFP/component/cpkcc.h
/* -------- CPKCC_ADDRSIZE : (CPKCC Offset: 0xEC) (R/W 32) ADDRSIZE Register -------- */
#define CPKCC_ADDRSIZE_VALUE_Pos              _UINT32_(0)                                          /* (CPKCC_ADDRSIZE) CPKCC_ADDRSIZE value Position */
#define CPKCC_ADDRSIZE_VALUE_Msk              (_UINT32_(0xFFFFFFFF) << CPKCC_ADDRSIZE_VALUE_Pos)   /* (CPKCC_ADDRSIZE) CPKCC_ADDRSIZE value Mask */
#define CPKCC_ADDRSIZE_VALUE(value)           (CPKCC_ADDRSIZE_VALUE_Msk & (_UINT32_(value) << CPKCC_ADDRSIZE_VALUE_Pos)) /* Assigment of value for VALUE in the CPKCC_ADDRSIZE register */
#define CPKCC_ADDRSIZE_Msk                    _UINT32_(0xFFFFFFFF)                                 /* (CPKCC_ADDRSIZE) Register Mask  */


/* -------- CPKCC_IPNAME : (CPKCC Offset: 0xF0) (R/W 32) IPNAME1 Register -------- */
#define CPKCC_IPNAME_VALUE_Pos                _UINT32_(0)                                          /* (CPKCC_IPNAME) CPKCC_IPNAME1 value Position */
#define CPKCC_IPNAME_VALUE_Msk                (_UINT32_(0xFFFFFFFF) << CPKCC_IPNAME_VALUE_Pos)     /* (CPKCC_IPNAME) CPKCC_IPNAME1 value Mask */
#define CPKCC_IPNAME_VALUE(value)             (CPKCC_IPNAME_VALUE_Msk & (_UINT32_(value) << CPKCC_IPNAME_VALUE_Pos)) /* Assigment of value for VALUE in the CPKCC_IPNAME register */
#define CPKCC_IPNAME_Msk                      _UINT32_(0xFFFFFFFF)                                 /* (CPKCC_IPNAME) Register Mask  */


/* -------- CPKCC_FEATURES : (CPKCC Offset: 0xF8) (R/W 32) FEATURES Register -------- */
#define CPKCC_FEATURES_VALUE_Pos              _UINT32_(0)                                          /* (CPKCC_FEATURES) CPKCC_FEATURES value Position */
#define CPKCC_FEATURES_VALUE_Msk              (_UINT32_(0xFFFFFFFF) << CPKCC_FEATURES_VALUE_Pos)   /* (CPKCC_FEATURES) CPKCC_FEATURES value Mask */
#define CPKCC_FEATURES_VALUE(value)           (CPKCC_FEATURES_VALUE_Msk & (_UINT32_(value) << CPKCC_FEATURES_VALUE_Pos)) /* Assigment of value for VALUE in the CPKCC_FEATURES register */
#define CPKCC_FEATURES_Msk                    _UINT32_(0xFFFFFFFF)                                 /* (CPKCC_FEATURES) Register Mask  */


/** \brief CPKCC register offsets definitions */
#define CPKCC_R_REG_OFST               _UINT32_(0x00)      /* (CPKCC_R) R Parameter Register Offset */
#define CPKCC_X_REG_OFST               _UINT32_(0x04)      /* (CPKCC_X) X Parameter Register Offset */
#define CPKCC_Y_REG_OFST               _UINT32_(0x08)      /* (CPKCC_Y) Y Parameter Register Offset */
#define CPKCC_Z_REG_OFST               _UINT32_(0x0C)      /* (CPKCC_Z) Z Parameter Register Offset */
#define CPKCC_J_REG_OFST               _UINT32_(0x10)      /* (CPKCC_J) J Parameter Register Offset */
#define CPKCC_K_REG_OFST               _UINT32_(0x14)      /* (CPKCC_K) K Parameter Register Offset */
#define CPKCC_N_REG_OFST               _UINT32_(0x18)      /* (CPKCC_N) N Parameter Register Offset */
#define CPKCC_SMULA_REG_OFST           _UINT32_(0x1C)      /* (CPKCC_SMULA) SMULA Register Offset */
#define CPKCC_SMULB_REG_OFST           _UINT32_(0x20)      /* (CPKCC_SMULB) SMULB Register Offset */
#define CPKCC_SMULRL_REG_OFST          _UINT32_(0x24)      /* (CPKCC_SMULRL) SMULRL Register Offset */
#define CPKCC_SMULRH_REG_OFST          _UINT32_(0x28)      /* (CPKCC_SMULRH) SMULRH Register Offset */
#define CPKCC_IDLE_REG_OFST            _UINT32_(0x2C)      /* (CPKCC_IDLE) IDLE Register Offset */
#define CPKCC_IDLECACHE_REG_OFST       _UINT32_(0x2D)      /* (CPKCC_IDLECACHE) IDLECACHE Register Offset */
#define CPKCC_CR_C_REG_OFST            _UINT32_(0x30)      /* (CPKCC_CR_C) CR_C Register Offset */
#define CPKCC_CR_S_REG_OFST            _UINT32_(0x34)      /* (CPKCC_CR_S) CR_S Register Offset */
#define CPKCC_CR_REG_OFST              _UINT32_(0x38)      /* (CPKCC_CR) CR Register Offset */
#define CPKCC_OR_REG_OFST              _UINT32_(0x3C)      /* (CPKCC_OR) Operation Register Offset */
#define CPKCC_SR_REG_OFST              _UINT32_(0x40)      /* (CPKCC_SR) SR Register Offset */
#define CPKCC_ADDRSIZE_REG_OFST        _UINT32_(0xEC)      /* (CPKCC_ADDRSIZE) ADDRSIZE Register Offset */
#define CPKCC_IPNAME_REG_OFST          _UINT32_(0xF0)      /* (CPKCC_IPNAME) IPNAME1 Register Offset */
#define CPKCC_IPNAME0_REG_OFST         _UINT32_(0xF0)      /* (CPKCC_IPNAME0) IPNAME1 Register Offset */
#define CPKCC_IPNAME1_REG_OFST         _UINT32_(0xF4)      /* (CPKCC_IPNAME1) IPNAME1 Register Offset */
#define CPKCC_FEATURES_REG_OFST        _UINT32_(0xF8)      /* (CPKCC_FEATURES) FEATURES Register Offset */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief CPKCC register API structure */
typedef struct
{
  __IO  uint32_t                       CPKCC_R;            /**< Offset: 0x00 (R/W  32) R Parameter Register */
  __IO  uint32_t                       CPKCC_X;            /**< Offset: 0x04 (R/W  32) X Parameter Register */
  __IO  uint32_t                       CPKCC_Y;            /**< Offset: 0x08 (R/W  32) Y Parameter Register */
  __IO  uint32_t                       CPKCC_Z;            /**< Offset: 0x0C (R/W  32) Z Parameter Register */
  __IO  uint32_t                       CPKCC_J;            /**< Offset: 0x10 (R/W  32) J Parameter Register */
  __IO  uint32_t                       CPKCC_K;            /**< Offset: 0x14 (R/W  32) K Parameter Register */
  __IO  uint32_t                       CPKCC_N;            /**< Offset: 0x18 (R/W  32) N Parameter Register */
  __IO  uint32_t                       CPKCC_SMULA;        /**< Offset: 0x1C (R/W  32) SMULA Register */
  __IO  uint32_t                       CPKCC_SMULB;        /**< Offset: 0x20 (R/W  32) SMULB Register */
  __IO  uint32_t                       CPKCC_SMULRL;       /**< Offset: 0x24 (R/W  32) SMULRL Register */
  __IO  uint32_t                       CPKCC_SMULRH;       /**< Offset: 0x28 (R/W  32) SMULRH Register */
  __IO  uint8_t                        CPKCC_IDLE;         /**< Offset: 0x2C (R/W  8) IDLE Register */
  __IO  uint8_t                        CPKCC_IDLECACHE;    /**< Offset: 0x2D (R/W  8) IDLECACHE Register */
  __I   uint8_t                        Reserved1[0x02];
  __IO  uint32_t                       CPKCC_CR_C;         /**< Offset: 0x30 (R/W  32) CR_C Register */
  __IO  uint32_t                       CPKCC_CR_S;         /**< Offset: 0x34 (R/W  32) CR_S Register */
  __IO  uint32_t                       CPKCC_CR;           /**< Offset: 0x38 (R/W  32) CR Register */
  __IO  uint32_t                       CPKCC_OR;           /**< Offset: 0x3C (R/W  32) Operation Register */
  __IO  uint32_t                       CPKCC_SR;           /**< Offset: 0x40 (R/W  32) SR Register */
  __I   uint8_t                        Reserved2[0xA8];
  __IO  uint32_t                       CPKCC_ADDRSIZE;     /**< Offset: 0xEC (R/W  32) ADDRSIZE Register */
  __IO  uint32_t                       CPKCC_IPNAME[2];    /**< Offset: 0xF0 (R/W  32) IPNAME1 Register */
  __IO  uint32_t                       CPKCC_FEATURES;     /**< Offset: 0xF8 (R/W  32) FEATURES Register */
} cpkcc_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _PIC32CXMTSH_CPKCC_COMPONENT_H_ */
